backend/InformationRegisters/РейтингИнициатив.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>РейтингИнициатив</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОценкаЛайк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инициатива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инициатива</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователь</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

backend/InformationRegisters/ОтветыНаВопросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ОтветыНаВопросы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ответы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инициатива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инициатива</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователь</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вопросы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вопросы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

backend/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

backend/Documents/Опрос.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>Опрос</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инициатива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инициатива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Вопросы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

backend/Catalogs/Пользователь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Пользователь</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобильныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

backend/Catalogs/Инициатива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Инициатива</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступностьЮрЛицам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступностьФизЛицам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВложенияФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПроизвольныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

backend/HTTPServices/Сервер/Ext/Module.bsl
Функция ВыгрузитьСписокИнициативВыгрузитьСписокИнициатив(Запрос)
	
	Login = Запрос.ПараметрыURL.Получить("Login");
	
	ЗапросПОльзователь = Новый Запрос;
	ЗапросПОльзователь.Текст =   "ВЫБРАТЬ
	                             |	Пользователь.Ссылка КАК Ссылка,
	                             |	ВЫБОР
	                             |		КОГДА Пользователь.ЮрФизЛицо = ЗНАЧЕНИЕ(перечисление.ЮрФизЛицо.ФизЛицо)
	                             |			ТОГДА ""ФизЛицо""
	                             |		ИНАЧЕ ""ЮрЛицо""
	                             |	КОНЕЦ КАК ЮрФизЛицо
	                             |ИЗ
	                             |	Справочник.Пользователь КАК Пользователь
	                             |ГДЕ
	                             |	Пользователь.Логин = &Логин" ;
	ЗапросПОльзователь.УстановитьПараметр("Логин",Строка(Login)); 
	
	//Если ЗапросПОльзователь.Выполнить().Пустой() Тогда 
	//КонецЕсли;
	
	ВЫборка = ЗапросПОльзователь.Выполнить().Выбрать();
	
	ФизЮрЛицо = "";
	Пока ВЫборка.Следующий() Цикл 
		ФизЮрЛицо = ВЫборка.ЮрФизЛицо;
	КонецЦикла;
	
	//ФизЮрЛицо =ФизЮрЛицо 
	//Строка(Запрос.ПараметрыURL.Получить("fizik"));

	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("ФизЮрЛицо", ФизЮрЛицо);
	
	Обработка = Обработки.ВыгрузитьСписокИнициатив.Создать();
	Результат = Обработка.СформироватьСписокИнициатив(ПараметрыПроверки);	

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	//Ответ.УстановитьТелоИзСтроки("<Response><Code>-1</Code><Message>Неизвестный запрос</Message></Response>");
	Ответ.УстановитьТелоИзСтроки(Результат.Сообщение);
	
	Возврат Ответ;

КонецФункции

Функция ВыгрузитьИнициативу(Запрос)
	
	Login = Запрос.ПараметрыURL.Получить("Login");
	ЗапросПОльзователь = Новый Запрос;
	ЗапросПОльзователь.Текст =   "ВЫБРАТЬ
	                             |	Пользователь.Ссылка КАК Ссылка,
	                             |	ВЫБОР
	                             |		КОГДА Пользователь.ЮрФизЛицо = ЗНАЧЕНИЕ(перечисление.ЮрФизЛицо.ФизЛицо)
	                             |			ТОГДА ""ФизЛицо""
	                             |		ИНАЧЕ ""ЮрЛицо""
	                             |	КОНЕЦ КАК ЮрФизЛицо
	                             |ИЗ
	                             |	Справочник.Пользователь КАК Пользователь
	                             |ГДЕ
	                             |	Пользователь.Логин = &Логин" ;
	ЗапросПОльзователь.УстановитьПараметр("Логин",Строка(Login)); 
	
	ВЫборка = ЗапросПОльзователь.Выполнить().Выбрать();
	
	ПОльзователь = Справочники.Пользователь.ПустаяСсылка();
	Пока ВЫборка.Следующий() Цикл 
		ПОльзователь = ВЫборка.Ссылка;
	КонецЦикла;

	//ЗаписьЖурналаРегистрации("ПОльзователь",,,ПОльзователь);
	
	
	
	
	Guid = Запрос.ПараметрыURL.Получить("Guid");
	УИД = Новый УникальныйИдентификатор(Guid);
		//ЗаписьЖурналаРегистрации("Guid",,,Guid);

	СсылкаНаИнициативу = Справочники.Инициатива.ПолучитьСсылку(УИД);
		//ЗаписьЖурналаРегистрации("СсылкаНаИнициативу",,,СсылкаНаИнициативу);
	ЗапросИнициатива = Новый Запрос;
	ЗапросИнициатива.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                         |	Инициатива.Ссылка КАК Ссылка,
	                         |	Инициатива.Наименование КАК Наименование,
	                         |	Инициатива.Содержание КАК Содержание,
	                         |	Инициатива.СрокДо КАК СрокДо,
	                         |	Инициатива.ДоступностьЮрЛицам КАК ДоступностьЮрЛицам,
	                         |	Инициатива.ДоступностьФизЛицам КАК ДоступностьФизЛицам
	                         |ПОМЕСТИТЬ ВТ
	                         |ИЗ
	                         |	Справочник.Инициатива КАК Инициатива
	                         |;
	                         |
	                         |////////////////////////////////////////////////////////////////////////////////
	                         |ВЫБРАТЬ
	                         |	СУММА(ЕСТЬNULL(РейтингИнициатив.ОценкаЛайк, 0)) КАК ОценкаЛайк,
	                         |	СУММА(ЕСТЬNULL(РейтингИнициатив.ОценкаДизЛайк, 0)) КАК ОценкаДизЛайк,
	                         |	РейтингИнициатив.Инициатива КАК Инициатива
	                         |ПОМЕСТИТЬ ВТ_рейтинг
	                         |ИЗ
	                         |	РегистрСведений.РейтингИнициатив КАК РейтингИнициатив
	                         |
	                         |СГРУППИРОВАТЬ ПО
	                         |	РейтингИнициатив.Инициатива
	                         |;
	                         |
	                         |////////////////////////////////////////////////////////////////////////////////
	                         |ВЫБРАТЬ
	                         |	ВТ.Ссылка КАК Ссылка,
	                         |	ВТ.Наименование КАК Наименование,
	                         |	ВТ.Содержание КАК Содержание,
	                         |	ВТ.СрокДо КАК СрокДо,
	                         |	ВТ.ДоступностьЮрЛицам КАК ДоступностьЮрЛицам,
	                         |	ВТ.ДоступностьФизЛицам КАК ДоступностьФизЛицам,
	                         |	ЕСТЬNULL(ВТ_рейтинг.ОценкаЛайк, 0) КАК ОценкаЛайк,
	                         |	ЕСТЬNULL(ВТ_рейтинг.ОценкаДизЛайк, 0) КАК ОценкаДизЛайк
	                         |ИЗ
	                         |	ВТ КАК ВТ
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_рейтинг КАК ВТ_рейтинг
	                         |		ПО ВТ.Ссылка = ВТ_рейтинг.Инициатива
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветыНаВопросы КАК ОтветыНаВопросы
	                         |		ПО ВТ.Ссылка = ОтветыНаВопросы.Инициатива
	                         |ГДЕ
	                         |	ВТ.Ссылка = &Ссылка";
	ЗапросИнициатива.УстановитьПараметр("Ссылка",СсылкаНаИнициативу );
	//ЗапросИнициатива.УстановитьПараметр("ПОльзователь",ПОльзователь );
	
	
	Результат = Новый Структура("КодОтвета, Сообщение, СообщениеОбОшибке");
	ИмяФайлаВыгрузки = КаталогВременныхФайлов() + "\123.json";     
	
	РезЗапроса = ЗапросИнициатива.Выполнить();
	
	ВыборкаПоИнициативе = РезЗапроса.Выбрать();
	
	
	Инициатива = Новый Структура;
	
	Пока ВыборкаПоИнициативе.Следующий() Цикл 
		Инициатива.Вставить("Наименование",ВыборкаПоИнициативе.Наименование);
		Инициатива.Вставить("ОценкаЛайк",ВыборкаПоИнициативе.ОценкаЛайк);
		Инициатива.Вставить("ОценкаДизЛайк",ВыборкаПоИнициативе.ОценкаДизЛайк);
		Инициатива.Вставить("ДоступностьЮрЛицам",ВыборкаПоИнициативе.ДоступностьЮрЛицам);
		Инициатива.Вставить("ДоступностьФизЛицам",ВыборкаПоИнициативе.ДоступностьФизЛицам);
		Инициатива.Вставить("ГУИД",Строка(ВыборкаПоИнициативе.Ссылка.УникальныйИдентификатор()));
		Инициатива.Вставить("Содержание",ВыборкаПоИнициативе.Содержание);
		Инициатива.Вставить("СрокДо",Формат(ВыборкаПоИнициативе.СрокДо,"ДФ=dd.MM.yyyy"));
		Результат.Вставить("КодОтвета", Истина);
		Результат.Вставить("СообщениеОбОшибке", "");
		 ЗаписьЖурналаРегистрации("Guid",,,Guid);

		//Массив.Добавить(Инициатива);

	КонецЦикла;
	
	
	
	
	
	ЗапросОтзывы = Новый Запрос;
	ЗапросОтзывы.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                     |	Инициатива.Ссылка КАК Ссылка,
	                     |	Инициатива.Наименование КАК Наименование,
	                     |	Инициатива.Содержание КАК Содержание,
	                     |	Инициатива.СрокДо КАК СрокДо,
	                     |	Инициатива.ДоступностьЮрЛицам КАК ДоступностьЮрЛицам,
	                     |	Инициатива.ДоступностьФизЛицам КАК ДоступностьФизЛицам
	                     |ПОМЕСТИТЬ ВТ
	                     |ИЗ
	                     |	Справочник.Инициатива КАК Инициатива
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |ВЫБРАТЬ
	                     |	ВТ.Ссылка КАК Ссылка,
	                     |	ОтветыНаВопросы.Пользователь КАК Пользователь
	                     |ИЗ
	                     |	ВТ КАК ВТ
	                     |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветыНаВопросы КАК ОтветыНаВопросы
	                     |		ПО ВТ.Ссылка = ОтветыНаВопросы.Инициатива
	                     |ГДЕ
	                     |	ВТ.Ссылка = &Ссылка
	                     |	И ОтветыНаВопросы.Пользователь = &Пользователь";
	ЗапросОтзывы.УстановитьПараметр("Ссылка",СсылкаНаИнициативу );
	ЗапросОтзывы.УстановитьПараметр("ПОльзователь",ПОльзователь );
	
	Если ЗапросОтзывы.Выполнить().Пустой()  Тогда 
		Инициатива.Вставить("ПользовательПрошелОпрос",Ложь);
	Иначе 
		Инициатива.Вставить("ПользовательПрошелОпрос",Истина);
		
	КонецЕсли;

	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(); 
	ЗаписьJSON.ОткрытьФайл(ИмяФайлаВыгрузки, , , ПараметрыЗаписи) ; 
	ЗаписатьJSON(ЗаписьJSON, Инициатива); 
	ЗаписьJSON.Закрыть();
	
	ТекстДок = Новый ТекстовыйДокумент();
	ТекстДок.Прочитать(ИмяФайлаВыгрузки,КодировкаТекста.UTF8);
	
	
	Результат.Вставить("Сообщение", ТекстДок.ПолучитьТекст());
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	//Ответ.УстановитьТелоИзСтроки("<Response><Code>-1</Code><Message>Неизвестный запрос</Message></Response>");
	Ответ.УстановитьТелоИзСтроки(Результат.Сообщение);

	

	Возврат Ответ;
	//ТекстДок.ПолучитьТекст();

	
КонецФункции

Функция ВыгрузитьОпросы(Запрос)
	Login = Запрос.ПараметрыURL.Получить("Login");
	
	ЗапросПОльзователь = Новый Запрос;
	ЗапросПОльзователь.Текст =   "ВЫБРАТЬ
	|	Пользователь.Ссылка КАК Ссылка,
	                             |	ВЫБОР
	                             |		КОГДА Пользователь.ЮрФизЛицо = ЗНАЧЕНИЕ(перечисление.ЮрФизЛицо.ФизЛицо)
	                             |			ТОГДА ""ФизЛицо""
	                             |		ИНАЧЕ ""ЮрЛицо""
	                             |	КОНЕЦ КАК ЮрФизЛицо
	                             |ИЗ
	                             |	Справочник.Пользователь КАК Пользователь
	                             |ГДЕ
	                             |	Пользователь.Логин = &Логин" ;
	ЗапросПОльзователь.УстановитьПараметр("Логин",Строка(Login)); 
	
	ВЫборка = ЗапросПОльзователь.Выполнить().Выбрать();
	
	ПОльзователь = Справочники.Пользователь.ПустаяСсылка();
	Пока ВЫборка.Следующий() Цикл 
		ПОльзователь = ВЫборка.Ссылка;
	КонецЦикла;

	//ЗаписьЖурналаРегистрации("ПОльзователь",,,ПОльзователь);
	
	
	
	
	Guid = Запрос.ПараметрыURL.Получить("Guid");

	 	УИД = Новый УникальныйИдентификатор(Guid);
		//ЗаписьЖурналаРегистрации("Guid",,,Guid);

	СсылкаНаИнициативу = Справочники.Инициатива.ПолучитьСсылку(УИД);
		//ЗаписьЖурналаРегистрации("СсылкаНаИнициативу",,,СсылкаНаИнициативу);
	ЗапросИнициатива = Новый Запрос;
	ЗапросИнициатива.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                         |	Инициатива.Ссылка КАК Ссылка,
	                         |	Инициатива.Наименование КАК Наименование,
	                         |	Инициатива.Содержание КАК Содержание,
	                         |	Инициатива.СрокДо КАК СрокДо,
	                         |	Инициатива.ДоступностьЮрЛицам КАК ДоступностьЮрЛицам,
	                         |	Инициатива.ДоступностьФизЛицам КАК ДоступностьФизЛицам
	                         |ПОМЕСТИТЬ ВТ
	                         |ИЗ
	                         |	Справочник.Инициатива КАК Инициатива
	                         |;
	                         |
	                         |////////////////////////////////////////////////////////////////////////////////
	                         |ВЫБРАТЬ
	                         |	СУММА(ЕСТЬNULL(РейтингИнициатив.ОценкаЛайк, 0)) КАК ОценкаЛайк,
	                         |	СУММА(ЕСТЬNULL(РейтингИнициатив.ОценкаДизЛайк, 0)) КАК ОценкаДизЛайк,
	                         |	РейтингИнициатив.Инициатива КАК Инициатива
	                         |ПОМЕСТИТЬ ВТ_рейтинг
	                         |ИЗ
	                         |	РегистрСведений.РейтингИнициатив КАК РейтингИнициатив
	                         |
	                         |СГРУППИРОВАТЬ ПО
	                         |	РейтингИнициатив.Инициатива
	                         |;
	                         |
	                         |////////////////////////////////////////////////////////////////////////////////
	                         |ВЫБРАТЬ
	                         |	ВТ.Ссылка КАК Ссылка,
	                         |	ВТ.Наименование КАК Наименование,
	                         |	ВТ.Содержание КАК Содержание,
	                         |	ВТ.СрокДо КАК СрокДо,
	                         |	ВТ.ДоступностьЮрЛицам КАК ДоступностьЮрЛицам,
	                         |	ВТ.ДоступностьФизЛицам КАК ДоступностьФизЛицам,
	                         |	ЕСТЬNULL(ВТ_рейтинг.ОценкаЛайк, 0) КАК ОценкаЛайк,
	                         |	ЕСТЬNULL(ВТ_рейтинг.ОценкаДизЛайк, 0) КАК ОценкаДизЛайк
	                         |ИЗ
	                         |	ВТ КАК ВТ
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_рейтинг КАК ВТ_рейтинг
	                         |		ПО ВТ.Ссылка = ВТ_рейтинг.Инициатива
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветыНаВопросы КАК ОтветыНаВопросы
	                         |		ПО ВТ.Ссылка = ОтветыНаВопросы.Инициатива
	                         |ГДЕ
	                         |	ВТ.Ссылка = &Ссылка";
	ЗапросИнициатива.УстановитьПараметр("Ссылка",СсылкаНаИнициативу );
	//ЗапросИнициатива.УстановитьПараметр("ПОльзователь",ПОльзователь );
	
	
	Результат = Новый Структура("КодОтвета, Сообщение, СообщениеОбОшибке");
	ИмяФайлаВыгрузки = КаталогВременныхФайлов() + "\123.json";     
	
	РезЗапроса = ЗапросИнициатива.Выполнить();
	
	ВыборкаПоИнициативе = РезЗапроса.Выбрать();
	
	
	Инициатива = Новый Структура;
	
	Пока ВыборкаПоИнициативе.Следующий() Цикл 
		Инициатива.Вставить("Наименование",ВыборкаПоИнициативе.Наименование);
		Инициатива.Вставить("ОценкаЛайк",ВыборкаПоИнициативе.ОценкаЛайк);
		Инициатива.Вставить("ОценкаДизЛайк",ВыборкаПоИнициативе.ОценкаДизЛайк);
		Инициатива.Вставить("ДоступностьЮрЛицам",ВыборкаПоИнициативе.ДоступностьЮрЛицам);
		Инициатива.Вставить("ДоступностьФизЛицам",ВыборкаПоИнициативе.ДоступностьФизЛицам);
		Инициатива.Вставить("ГУИД",Строка(ВыборкаПоИнициативе.Ссылка.УникальныйИдентификатор()));
		Инициатива.Вставить("Содержание",ВыборкаПоИнициативе.Содержание);
		Инициатива.Вставить("СрокДо",Формат(ВыборкаПоИнициативе.СрокДо,"ДФ=dd.MM.yyyy"));
		Результат.Вставить("КодОтвета", Истина);
		Результат.Вставить("СообщениеОбОшибке", "");
		 ЗаписьЖурналаРегистрации("Guid",,,Guid);


	КонецЦикла;
	

	
	
	
	
	
	ЗапросОтзывы = Новый Запрос;
	ЗапросОтзывы.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                     |	Инициатива.Ссылка КАК Ссылка,
	                     |	Инициатива.Наименование КАК Наименование,
	                     |	Инициатива.Содержание КАК Содержание,
	                     |	Инициатива.СрокДо КАК СрокДо,
	                     |	Инициатива.ДоступностьЮрЛицам КАК ДоступностьЮрЛицам,
	                     |	Инициатива.ДоступностьФизЛицам КАК ДоступностьФизЛицам
	                     |ПОМЕСТИТЬ ВТ
	                     |ИЗ
	                     |	Справочник.Инициатива КАК Инициатива
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |ВЫБРАТЬ
	                     |	ВТ.Ссылка КАК Ссылка,
	                     |	ОпросВопросы.Вопрос КАК Вопрос,
	                     |	ОпросВопросы.Вопрос.ТипВопроса КАК ТипВопроса
	                     |ИЗ
	                     |	ВТ КАК ВТ
	                     |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Опрос КАК Опрос
	                     |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Опрос.Вопросы КАК ОпросВопросы
	                     |			ПО Опрос.Ссылка = ОпросВопросы.Ссылка
	                     |		ПО ВТ.Ссылка = Опрос.Инициатива
	                     |ГДЕ
	                     |	ВТ.Ссылка = &Ссылка";
	ЗапросОтзывы.УстановитьПараметр("Ссылка",СсылкаНаИнициативу );
	//ЗапросОтзывы.УстановитьПараметр("ПОльзователь",ПОльзователь );
	
	Если НЕ ЗапросОтзывы.Выполнить().Пустой()  Тогда 
		Инициатива.Вставить("ПользовательПрошелОпрос",Ложь);
		
		ВыборкаОтзывы = ЗапросОтзывы.Выполнить().Выбрать();
		МассивВопросов = Новый Массив;
		МассивОтветов = Новый Массив;
		
		Пока ВыборкаОтзывы.Следующий() Цикл 
			ВопросОтветы = Новый Структура;
			//ВопросОтветы.Вставить("Инициатива", Строка(ВыборкаОтзывы.Ссылка.УникальныйИдентификатор()));
			ВопросОтветы.Вставить("ТипВопроса", СТрока(ВыборкаОтзывы.ТипВопроса));
			ВопросОтветы.Вставить("Вопрос", СТрока(ВыборкаОтзывы.Вопрос));
			ВопросОтветы.Вставить("КодВопроса", СТрока(ВыборкаОтзывы.Вопрос.Код));
			МассивВопросов.Добавить(ВопросОтветы);
			
			Для Каждого Стр Из ВыборкаОтзывы.Вопрос.Ответы Цикл 
				СтруктураОтветы = Новый Структура;
				СтруктураОтветы.Вставить("КодОтвета", СТрока(Стр.Ответ.Код));
				СтруктураОтветы.Вставить("Ответ", СТрока(Стр.Ответ));
				МассивОтветов.Добавить(СтруктураОтветы);
			КонецЦикла;
			МассивВопросов.Добавить(МассивОтветов);
			
			
		КонецЦикла;
		Инициатива.Вставить("МассивВопросов",МассивВопросов);
		
			
	КонецЕсли;

	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(); 
	ЗаписьJSON.ОткрытьФайл(ИмяФайлаВыгрузки, , , ПараметрыЗаписи) ; 
	ЗаписатьJSON(ЗаписьJSON, Инициатива); 
	ЗаписьJSON.Закрыть();
	
	ТекстДок = Новый ТекстовыйДокумент();
	ТекстДок.Прочитать(ИмяФайлаВыгрузки,КодировкаТекста.UTF8);
	
	
	Результат.Вставить("Сообщение", ТекстДок.ПолучитьТекст());
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	//Ответ.УстановитьТелоИзСтроки("<Response><Code>-1</Code><Message>Неизвестный запрос</Message></Response>");
	Ответ.УстановитьТелоИзСтроки(Результат.Сообщение);

	

	Возврат Ответ;
	

	
КонецФункции

Функция ВыгрузитьВыгрузить(Запрос)
	Login = Запрос.ПараметрыURL.Получить("Login");
	ЗапросПОльзователь = Новый Запрос;
	ЗапросПОльзователь.Текст =   "ВЫБРАТЬ
	                             |	Пользователь.Ссылка КАК Ссылка,
	                             |	ВЫБОР
	                             |		КОГДА Пользователь.ЮрФизЛицо = ЗНАЧЕНИЕ(перечисление.ЮрФизЛицо.ФизЛицо)
	                             |			ТОГДА ""ФизЛицо""
	                             |		ИНАЧЕ ""ЮрЛицо""
	                             |	КОНЕЦ КАК ЮрФизЛицо
	                             |ИЗ
	                             |	Справочник.Пользователь КАК Пользователь
	                             |ГДЕ
	                             |	Пользователь.Логин = &Логин" ;
	ЗапросПОльзователь.УстановитьПараметр("Логин",Строка(Login)); 
	
	ВЫборка = ЗапросПОльзователь.Выполнить().Выбрать();
	
	ПОльзователь = Справочники.Пользователь.ПустаяСсылка();
	Пока ВЫборка.Следующий() Цикл 
		ПОльзователь = ВЫборка.Ссылка;
	КонецЦикла;

	//ЗаписьЖурналаРегистрации("ПОльзователь",,,ПОльзователь);
	
	
	
	
	Guid = Запрос.ПараметрыURL.Получить("Guid");
	УИД = Новый УникальныйИдентификатор(Guid);
		//ЗаписьЖурналаРегистрации("Guid",,,Guid);

	СсылкаНаИнициативу = Справочники.Инициатива.ПолучитьСсылку(УИД);
		//ЗаписьЖурналаРегистрации("СсылкаНаИнициативу",,,СсылкаНаИнициативу);
	ЗапросИнициатива = Новый Запрос;
	ЗапросИнициатива.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                         |	Инициатива.Ссылка КАК Ссылка,
	                         |	Инициатива.Наименование КАК Наименование,
	                         |	Инициатива.Содержание КАК Содержание,
	                         |	Инициатива.СрокДо КАК СрокДо,
	                         |	Инициатива.ДоступностьЮрЛицам КАК ДоступностьЮрЛицам,
	                         |	Инициатива.ДоступностьФизЛицам КАК ДоступностьФизЛицам
	                         |ПОМЕСТИТЬ ВТ
	                         |ИЗ
	                         |	Справочник.Инициатива КАК Инициатива
	                         |;
	                         |
	                         |////////////////////////////////////////////////////////////////////////////////
	                         |ВЫБРАТЬ
	                         |	СУММА(ЕСТЬNULL(РейтингИнициатив.ОценкаЛайк, 0)) КАК ОценкаЛайк,
	                         |	СУММА(ЕСТЬNULL(РейтингИнициатив.ОценкаДизЛайк, 0)) КАК ОценкаДизЛайк,
	                         |	РейтингИнициатив.Инициатива КАК Инициатива
	                         |ПОМЕСТИТЬ ВТ_рейтинг
	                         |ИЗ
	                         |	РегистрСведений.РейтингИнициатив КАК РейтингИнициатив
	                         |
	                         |СГРУППИРОВАТЬ ПО
	                         |	РейтингИнициатив.Инициатива
	                         |;
	                         |
	                         |////////////////////////////////////////////////////////////////////////////////
	                         |ВЫБРАТЬ
	                         |	ВТ.Ссылка КАК Ссылка,
	                         |	ВТ.Наименование КАК Наименование,
	                         |	ВТ.Содержание КАК Содержание,
	                         |	ВТ.СрокДо КАК СрокДо,
	                         |	ВТ.ДоступностьЮрЛицам КАК ДоступностьЮрЛицам,
	                         |	ВТ.ДоступностьФизЛицам КАК ДоступностьФизЛицам,
	                         |	ЕСТЬNULL(ВТ_рейтинг.ОценкаЛайк, 0) КАК ОценкаЛайк,
	                         |	ЕСТЬNULL(ВТ_рейтинг.ОценкаДизЛайк, 0) КАК ОценкаДизЛайк
	                         |ИЗ
	                         |	ВТ КАК ВТ
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_рейтинг КАК ВТ_рейтинг
	                         |		ПО ВТ.Ссылка = ВТ_рейтинг.Инициатива
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветыНаВопросы КАК ОтветыНаВопросы
	                         |		ПО ВТ.Ссылка = ОтветыНаВопросы.Инициатива
	                         |ГДЕ
	                         |	ВТ.Ссылка = &Ссылка";
	ЗапросИнициатива.УстановитьПараметр("Ссылка",СсылкаНаИнициативу );
	//ЗапросИнициатива.УстановитьПараметр("ПОльзователь",ПОльзователь );
	
	
	Результат = Новый Структура("КодОтвета, Сообщение, СообщениеОбОшибке");
	ИмяФайлаВыгрузки = КаталогВременныхФайлов() + "\123.json";     
	
	РезЗапроса = ЗапросИнициатива.Выполнить();
	
	ВыборкаПоИнициативе = РезЗапроса.Выбрать();
	
	
	Инициатива = Новый Структура;
	
	Пока ВыборкаПоИнициативе.Следующий() Цикл 
		Инициатива.Вставить("Наименование",ВыборкаПоИнициативе.Наименование);
		Инициатива.Вставить("ОценкаЛайк",ВыборкаПоИнициативе.ОценкаЛайк);
		Инициатива.Вставить("ОценкаДизЛайк",ВыборкаПоИнициативе.ОценкаДизЛайк);
		Инициатива.Вставить("ДоступностьЮрЛицам",ВыборкаПоИнициативе.ДоступностьЮрЛицам);
		Инициатива.Вставить("ДоступностьФизЛицам",ВыборкаПоИнициативе.ДоступностьФизЛицам);
		Инициатива.Вставить("ГУИД",Строка(ВыборкаПоИнициативе.Ссылка.УникальныйИдентификатор()));
		Инициатива.Вставить("Содержание",ВыборкаПоИнициативе.Содержание);
		Инициатива.Вставить("СрокДо",Формат(ВыборкаПоИнициативе.СрокДо,"ДФ=dd.MM.yyyy"));
		Результат.Вставить("КодОтвета", Истина);
		Результат.Вставить("СообщениеОбОшибке", "");
		 ЗаписьЖурналаРегистрации("Guid",,,Guid);

		//Массив.Добавить(Инициатива);

	КонецЦикла;
	
	
	
	
	
	ЗапросОтзывы = Новый Запрос;
	ЗапросОтзывы.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                     |	Инициатива.Ссылка КАК Ссылка,
	                     |	Инициатива.Наименование КАК Наименование,
	                     |	Инициатива.Содержание КАК Содержание,
	                     |	Инициатива.СрокДо КАК СрокДо,
	                     |	Инициатива.ДоступностьЮрЛицам КАК ДоступностьЮрЛицам,
	                     |	Инициатива.ДоступностьФизЛицам КАК ДоступностьФизЛицам
	                     |ПОМЕСТИТЬ ВТ
	                     |ИЗ
	                     |	Справочник.Инициатива КАК Инициатива
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |ВЫБРАТЬ
	                     |	ВТ.Ссылка КАК Ссылка,
	                     |	ОтветыНаВопросы.Пользователь КАК Пользователь,
	                     |	ОтветыНаВопросы.Вопросы КАК Вопросы,
	                     |	ОтветыНаВопросы.Ответ КАК Ответ
	                     |ИЗ
	                     |	ВТ КАК ВТ
	                     |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветыНаВопросы КАК ОтветыНаВопросы
	                     |		ПО ВТ.Ссылка = ОтветыНаВопросы.Инициатива
	                     |ГДЕ
	                     |	ВТ.Ссылка = &Ссылка
	                     |	И ОтветыНаВопросы.Пользователь = &Пользователь";
	ЗапросОтзывы.УстановитьПараметр("Ссылка",СсылкаНаИнициативу );
	ЗапросОтзывы.УстановитьПараметр("ПОльзователь",ПОльзователь );
	
	Если ЗапросОтзывы.Выполнить().Пустой()  Тогда 
		Инициатива.Вставить("ПользовательПрошелОпрос",Ложь);
	Иначе 
		Инициатива.Вставить("ПользовательПрошелОпрос",Истина);
		
	КонецЕсли;

	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(); 
	ЗаписьJSON.ОткрытьФайл(ИмяФайлаВыгрузки, , , ПараметрыЗаписи) ; 
	ЗаписатьJSON(ЗаписьJSON, Инициатива); 
	ЗаписьJSON.Закрыть();
	
	ТекстДок = Новый ТекстовыйДокумент();
	ТекстДок.Прочитать(ИмяФайлаВыгрузки,КодировкаТекста.UTF8);
	
	
	Результат.Вставить("Сообщение", ТекстДок.ПолучитьТекст());
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	//Ответ.УстановитьТелоИзСтроки("<Response><Code>-1</Code><Message>Неизвестный запрос</Message></Response>");
	Ответ.УстановитьТелоИзСтроки(Результат.Сообщение);

	

	Возврат Ответ;
	//ТекстДок.ПолучитьТекст();
КонецФункции

Функция ПолучитьОценкуИнициативыПолучитьОценкуИнициативы(Запрос)

	Login = Запрос.ПараметрыURL.Получить("Login");
	
	ЗапросПОльзователь = Новый Запрос;
	ЗапросПОльзователь.Текст =   "ВЫБРАТЬ
	|	Пользователь.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Пользователь.ЮрФизЛицо = ЗНАЧЕНИЕ(перечисление.ЮрФизЛицо.ФизЛицо)
	|			ТОГДА ""ФизЛицо""
	|		ИНАЧЕ ""ЮрЛицо""
	|	КОНЕЦ КАК ЮрФизЛицо
	|ИЗ
	|	Справочник.Пользователь КАК Пользователь
	|ГДЕ
	|	Пользователь.Логин = &Логин" ;
	ЗапросПОльзователь.УстановитьПараметр("Логин",Строка(Login)); 
	
	ВЫборка = ЗапросПОльзователь.Выполнить().Выбрать();
	
	ПОльзователь = Справочники.Пользователь.ПустаяСсылка();
	Пока ВЫборка.Следующий() Цикл 
		ПОльзователь = ВЫборка.Ссылка;
	КонецЦикла;
	
	Guid = Запрос.ПараметрыURL.Получить("Guid");
	УИД = Новый УникальныйИдентификатор(Guid);
	
	Инициатива = Справочники.Инициатива.ПолучитьСсылку(УИД);
	
	Лайк = Запрос.ПараметрыURL.Получить("Like");
	Дизлайк = Запрос.ПараметрыURL.Получить("Dislike");
	
	ЗаписьЖурналаРегистрации("Лайк",,,Лайк);
	ЗаписьЖурналаРегистрации("Дизлайк",,,Дизлайк);
	
	НаборЗаписей = РегистрыСведений.РейтингИнициатив.СоздатьМенеджерЗаписи();
	//.СоздатьНаборЗаписей();  
	НаборЗаписей.Инициатива = Инициатива;
	НаборЗаписей.Пользователь = Пользователь;
	//НаборЗаписей.Прочитать();
	//Если НаборЗаписей.Количество() = 0 Тогда
	//	НовыйРейтинг = НаборЗаписей.Добавить();
	//НаборЗаписей.Инициатива = Инициатива;
	//НаборЗаписей.Пользователь = Пользователь;
	//НовыйРейтинг.ОценкаЛайк = Лайк;
	//НовыйРейтинг.ОценкаДизЛайк = Дизлайк;
	//ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
	//	НовыйРейтинг = НаборЗаписей[0];
	//	//НовыйРейтинг.ОценкаЛайк = Лайк;
	//	//НовыйРейтинг.ОценкаДизЛайк = Дизлайк;
	//КонецЕсли;
	НаборЗаписей.ОценкаЛайк = Лайк;
	НаборЗаписей.ОценкаДизЛайк = Дизлайк;
	
	
	НаборЗаписей.Записать();	
	
	Результат = Новый Структура;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	Результат.Вставить("Сообщение",  Лайк);
	
	Ответ.УстановитьТелоИзСтроки(Результат.Сообщение);
	
	
	
	Возврат Ответ;
	
	
	
	
КонецФункции
